# Aulas extras de Series e Index

## Criando Series e DataFrames

In [1]:
import pandas as pd

### Series

#### A partir de uma lista

In [5]:
data = list(range(5))
data

[0, 1, 2, 3, 4]

In [3]:
s = pd.Series(data)
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [6]:
index = ['Linha' + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [7]:
s = pd.Series(data = data, index = index)
s

Linha0    0
Linha1    1
Linha2    2
Linha3    3
Linha4    4
dtype: int64

#### A partir de um dicionário

In [8]:
data = {'Linha' + str(i): i + 1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [9]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [11]:
s1 = s + 2
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [12]:
# é possível trabalhar com duas series para gerar uma terceira, desde que tenham o mesmo tamanho
s2 = s + s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

### DataFrame

#### A partir de listas

In [14]:
data = [list(range(i, i + 3)) for i in [1, 4, 7]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [15]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
index = ['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [17]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [18]:
columns = ['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [19]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

#### A partir de um dicionário

In [25]:
data = {'Coluna' + str(i): {'Linha' + str(j): 1 + j*3 + i for j in range(3)} for i in range(3)}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [27]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

#### A partir de tuplas

In [28]:
data = [tuple(range(i, i + 3)) for i in [1, 4, 7]]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [29]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## Concatenando DataFrames

In [30]:
for df, i in [(df1, 1), (df2, 2), (df3, 3)]:
    df[df > 0] = i
    print(df)

        Coluna0  Coluna1  Coluna2
Linha0        1        1        1
Linha1        1        1        1
Linha2        1        1        1
        Coluna0  Coluna1  Coluna2
Linha0        2        2        2
Linha1        2        2        2
Linha2        2        2        2
        Coluna0  Coluna1  Coluna2
Linha0        3        3        3
Linha1        3        3        3
Linha2        3        3        3

In [32]:
df4 = pd.concat([df1, df2, df3])
df4
# default axis é 0, para concatenar

        Coluna0  Coluna1  Coluna2
Linha0        1        1        1
Linha1        1        1        1
Linha2        1        1        1
Linha0        2        2        2
Linha1        2        2        2
Linha2        2        2        2
Linha0        3        3        3
Linha1        3        3        3
Linha2        3        3        3

In [33]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

,Coluna0,Coluna1,Coluna2,Coluna0,Coluna1,Coluna2,Coluna0,Coluna1,Coluna2
Linha0,1,1,1,2,2,2,3,3,3
Linha1,1,1,1,2,2,2,3,3,3
Linha2,1,1,1,2,2,2,3,3,3